In [1]:
import numpy as np
import pandas as pd

import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
test_data = pd.DataFrame([[1, 2, np.nan], [3, np.nan, 4],
                          [0, 1, 2]], columns=['one', 'two', 'three'])

In [3]:
test_data

   one  two  three
0    1  2.0    NaN
1    3  NaN    4.0
2    0  1.0    2.0

In [4]:
# Поиск пропусков
test_data.isna()

     one    two  three
0  False  False   True
1  False   True  False
2  False  False  False

In [5]:
#Столбцы или строки с пропусками мы можем удалить с помощью метода .dropna().
#При axis=0 удаляются строки, при 1 — столбцы, по умолчанию значение равно 0:
test_data.dropna(axis=0)

   one  two  three
2    0  1.0    2.0

In [6]:
test_data

   one  two  three
0    1  2.0    NaN
1    3  NaN    4.0
2    0  1.0    2.0

In [9]:
test_data.mean()

one      1.333333
two      1.500000
three    3.000000
dtype: float64